Microchip-MPLAB-Harmony/csp/apps/mcan/mcan_normal_operation_blocking/firmware/src/packs/ATSAMA5D27_DFP/component/aic.h
/* -------- AIC_IPR2 : (AIC Offset: 0x28) ( R/ 32) Interrupt Pending Register 2 -------- */
#define AIC_IPR2_PID64_Pos                    _U_(0)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID64_Msk                    (_U_(0x1) << AIC_IPR2_PID64_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID64(value)                 (AIC_IPR2_PID64_Msk & ((value) << AIC_IPR2_PID64_Pos))
#define AIC_IPR2_PID65_Pos                    _U_(1)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID65_Msk                    (_U_(0x1) << AIC_IPR2_PID65_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID65(value)                 (AIC_IPR2_PID65_Msk & ((value) << AIC_IPR2_PID65_Pos))
#define AIC_IPR2_PID66_Pos                    _U_(2)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID66_Msk                    (_U_(0x1) << AIC_IPR2_PID66_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID66(value)                 (AIC_IPR2_PID66_Msk & ((value) << AIC_IPR2_PID66_Pos))
#define AIC_IPR2_PID67_Pos                    _U_(3)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID67_Msk                    (_U_(0x1) << AIC_IPR2_PID67_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID67(value)                 (AIC_IPR2_PID67_Msk & ((value) << AIC_IPR2_PID67_Pos))
#define AIC_IPR2_PID68_Pos                    _U_(4)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID68_Msk                    (_U_(0x1) << AIC_IPR2_PID68_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID68(value)                 (AIC_IPR2_PID68_Msk & ((value) << AIC_IPR2_PID68_Pos))
#define AIC_IPR2_PID69_Pos                    _U_(5)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID69_Msk                    (_U_(0x1) << AIC_IPR2_PID69_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID69(value)                 (AIC_IPR2_PID69_Msk & ((value) << AIC_IPR2_PID69_Pos))
#define AIC_IPR2_PID70_Pos                    _U_(6)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID70_Msk                    (_U_(0x1) << AIC_IPR2_PID70_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID70(value)                 (AIC_IPR2_PID70_Msk & ((value) << AIC_IPR2_PID70_Pos))
#define AIC_IPR2_PID71_Pos                    _U_(7)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID71_Msk                    (_U_(0x1) << AIC_IPR2_PID71_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID71(value)                 (AIC_IPR2_PID71_Msk & ((value) << AIC_IPR2_PID71_Pos))
#define AIC_IPR2_PID72_Pos                    _U_(8)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID72_Msk                    (_U_(0x1) << AIC_IPR2_PID72_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID72(value)                 (AIC_IPR2_PID72_Msk & ((value) << AIC_IPR2_PID72_Pos))
#define AIC_IPR2_PID73_Pos                    _U_(9)                                               /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID73_Msk                    (_U_(0x1) << AIC_IPR2_PID73_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID73(value)                 (AIC_IPR2_PID73_Msk & ((value) << AIC_IPR2_PID73_Pos))
#define AIC_IPR2_SYS_Pos                      _U_(10)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_SYS_Msk                      (_U_(0x1) << AIC_IPR2_SYS_Pos)                       /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_SYS(value)                   (AIC_IPR2_SYS_Msk & ((value) << AIC_IPR2_SYS_Pos))  
#define AIC_IPR2_PID75_Pos                    _U_(11)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID75_Msk                    (_U_(0x1) << AIC_IPR2_PID75_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID75(value)                 (AIC_IPR2_PID75_Msk & ((value) << AIC_IPR2_PID75_Pos))
#define AIC_IPR2_PID76_Pos                    _U_(12)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID76_Msk                    (_U_(0x1) << AIC_IPR2_PID76_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID76(value)                 (AIC_IPR2_PID76_Msk & ((value) << AIC_IPR2_PID76_Pos))
#define AIC_IPR2_PID77_Pos                    _U_(13)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID77_Msk                    (_U_(0x1) << AIC_IPR2_PID77_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID77(value)                 (AIC_IPR2_PID77_Msk & ((value) << AIC_IPR2_PID77_Pos))
#define AIC_IPR2_PID78_Pos                    _U_(14)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID78_Msk                    (_U_(0x1) << AIC_IPR2_PID78_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID78(value)                 (AIC_IPR2_PID78_Msk & ((value) << AIC_IPR2_PID78_Pos))
#define AIC_IPR2_PID79_Pos                    _U_(15)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID79_Msk                    (_U_(0x1) << AIC_IPR2_PID79_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID79(value)                 (AIC_IPR2_PID79_Msk & ((value) << AIC_IPR2_PID79_Pos))
#define AIC_IPR2_PID80_Pos                    _U_(16)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID80_Msk                    (_U_(0x1) << AIC_IPR2_PID80_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID80(value)                 (AIC_IPR2_PID80_Msk & ((value) << AIC_IPR2_PID80_Pos))
#define AIC_IPR2_PID81_Pos                    _U_(17)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID81_Msk                    (_U_(0x1) << AIC_IPR2_PID81_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID81(value)                 (AIC_IPR2_PID81_Msk & ((value) << AIC_IPR2_PID81_Pos))
#define AIC_IPR2_PID82_Pos                    _U_(18)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID82_Msk                    (_U_(0x1) << AIC_IPR2_PID82_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID82(value)                 (AIC_IPR2_PID82_Msk & ((value) << AIC_IPR2_PID82_Pos))
#define AIC_IPR2_PID83_Pos                    _U_(19)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID83_Msk                    (_U_(0x1) << AIC_IPR2_PID83_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID83(value)                 (AIC_IPR2_PID83_Msk & ((value) << AIC_IPR2_PID83_Pos))
#define AIC_IPR2_PID84_Pos                    _U_(20)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID84_Msk                    (_U_(0x1) << AIC_IPR2_PID84_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID84(value)                 (AIC_IPR2_PID84_Msk & ((value) << AIC_IPR2_PID84_Pos))
#define AIC_IPR2_PID85_Pos                    _U_(21)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID85_Msk                    (_U_(0x1) << AIC_IPR2_PID85_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID85(value)                 (AIC_IPR2_PID85_Msk & ((value) << AIC_IPR2_PID85_Pos))
#define AIC_IPR2_PID86_Pos                    _U_(22)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID86_Msk                    (_U_(0x1) << AIC_IPR2_PID86_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID86(value)                 (AIC_IPR2_PID86_Msk & ((value) << AIC_IPR2_PID86_Pos))
#define AIC_IPR2_PID87_Pos                    _U_(23)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID87_Msk                    (_U_(0x1) << AIC_IPR2_PID87_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID87(value)                 (AIC_IPR2_PID87_Msk & ((value) << AIC_IPR2_PID87_Pos))
#define AIC_IPR2_PID88_Pos                    _U_(24)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID88_Msk                    (_U_(0x1) << AIC_IPR2_PID88_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID88(value)                 (AIC_IPR2_PID88_Msk & ((value) << AIC_IPR2_PID88_Pos))
#define AIC_IPR2_PID89_Pos                    _U_(25)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID89_Msk                    (_U_(0x1) << AIC_IPR2_PID89_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID89(value)                 (AIC_IPR2_PID89_Msk & ((value) << AIC_IPR2_PID89_Pos))
#define AIC_IPR2_PID90_Pos                    _U_(26)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID90_Msk                    (_U_(0x1) << AIC_IPR2_PID90_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID90(value)                 (AIC_IPR2_PID90_Msk & ((value) << AIC_IPR2_PID90_Pos))
#define AIC_IPR2_PID91_Pos                    _U_(27)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID91_Msk                    (_U_(0x1) << AIC_IPR2_PID91_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID91(value)                 (AIC_IPR2_PID91_Msk & ((value) << AIC_IPR2_PID91_Pos))
#define AIC_IPR2_PID92_Pos                    _U_(28)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID92_Msk                    (_U_(0x1) << AIC_IPR2_PID92_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID92(value)                 (AIC_IPR2_PID92_Msk & ((value) << AIC_IPR2_PID92_Pos))
#define AIC_IPR2_PID93_Pos                    _U_(29)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID93_Msk                    (_U_(0x1) << AIC_IPR2_PID93_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID93(value)                 (AIC_IPR2_PID93_Msk & ((value) << AIC_IPR2_PID93_Pos))
#define AIC_IPR2_PID94_Pos                    _U_(30)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID94_Msk                    (_U_(0x1) << AIC_IPR2_PID94_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID94(value)                 (AIC_IPR2_PID94_Msk & ((value) << AIC_IPR2_PID94_Pos))
#define AIC_IPR2_PID95_Pos                    _U_(31)                                              /**< (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID95_Msk                    (_U_(0x1) << AIC_IPR2_PID95_Pos)                     /**< (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID95(value)                 (AIC_IPR2_PID95_Msk & ((value) << AIC_IPR2_PID95_Pos))
#define AIC_IPR2_Msk                          _U_(0xFFFFFFFF)                                      /**< (AIC_IPR2) Register Mask  */


